Revit 2025 API
StructuralInstanceUsage Enumeration
 Represents the structural usage of a family instance.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum StructuralInstanceUsage
Public Enumeration StructuralInstanceUsage
public enum class StructuralInstanceUsage
type StructuralInstanceUsage
Members
Member name | Value | Description
Undefined | 0 |  indicates automatic
Wall | 1 |  Structural usage is as wall.
Column | 2 |  Structural usage is as column.
Girder | 3 |  Structural usage is as girder.
Joist | 4 |  Structural usage is as joist.
Purlin | 5 |  Structural usage is as purlin.
Other | 6 |  Structural usage is as "other".
Brace | 7 |  Structural usage is as brace.
HorizontalBracing | 8 |  Structural usage is as horizontal bracing.
KickerBracing | 9 |  Structural usage is as kicker bracing.
Automatic | 10 |  Structural usage is automatic.
TrussChord | 11 |  Structural usage is as truss chord.
TrussWeb | 12 |  Structural usage is as truss web.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace